Revit 2026 API

# FaceEvaluate Method

---

Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Evaluate(
	UV params
)
```
```vb
Public Function Evaluate (
	params As UV
) As XYZ
```
```cpp
public:
XYZ^ Evaluate(
	UV^ params
)
```
```fsharp
member Evaluate :
        params : UV -> XYZ
```

#### Parameters

params UV
    The parameters to be evaluated, in natural parameterization of the face.

#### Return Value

XYZThe XYZ coordinates.

The evaluation is performed on the underlying Surface, and can return results outside of the boundaries of the face.

#### Reference

Face Class

Autodesk.Revit.DB Namespace